package main

import (
	"fmt"
	"math"
)

// Задания 10
// Дана последовательность температурных колебаний: -25.4, -27.0 13.0,
// 19.0, 15.5, 24.5, -21.0, 32.5. Объединить данные значения в группы с
// шагом в 10 градусов. Последовательность в подмножноствах не важна.

// Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.


func main() {
	var temp = []float64 {-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	var t = make(map[int][]float64)

	for i:=0;i<len(temp);i++ {
		n := 0.00
		if temp[i] >= 0 {
			n = math.Floor(temp[i] / 10) * 10.00
		} else {
			n = math.Ceil(temp[i] / 10) * 10.00
		}
		t[int(n)] = append(t[int(n)], temp[i])
	}
	fmt.Println(t)
}